&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Spisok.СписокВыбора.Добавить("Деталь");
	Элементы.Spisok.СписокВыбора.Добавить("Сборочная единица");
	Элементы.Spisok.СписокВыбора.Добавить("Готовое изделие");
	
КонецПроцедуры

&НаКлиенте
Процедура SpisokОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Spisok = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура Demo(Команда)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Spisok;
	Сообщение.Сообщить();
	
КонецПроцедуры
